ЕРПУХАстенд.cbr_Основной/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>cbr_ОтрасльКонтрагента</name>
    <type>
      <types>CatalogRef.cbr_ОтраслиКонтрагентов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2e4e19e3-f318-469a-8bd1-9678b54892a1">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ОтраслиКонтрагентов/cbr_ОтраслиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ОтраслиКонтрагентов</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/Партнеры/Forms/ФормаЭлементаРеквизитыКонтрагента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ cba AlopinAS 27.01.26
&НаКлиенте
Процедура ОтрасльКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных();
	ГруппаОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование = Истина;
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	Если Объект.Клиент и Не Объект.Поставщик Тогда
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	ИначеЕсли Объект.Поставщик и Не Объект.Клиент Тогда	
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	ИначеЕсли Не Объект.Клиент и Не Объект.Поставщик Тогда
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Ложь;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Ложь;
	ИначеЕсли Объект.Поставщик и Объект.Клиент Тогда 
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);	
	
	СтруктураПараметров = Новый Структура;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("cbr_ОбработкаВыбораОтраслиКонтрагента", ЭтотОбъект, СтруктураПараметров);
	
	ОткрытьФорму("Справочник.cbr_ОтраслиКонтрагентов.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
//-- cba AlopinAS 27.01.26

//++ cba AlopinAS 27.01.26
&НаКлиенте
Процедура cbr_ОбработкаВыбораОтраслиКонтрагента(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Контейнер = Элементы.ОтрасльКонтрагента;
	Если Не Контейнер = Неопределено Тогда
		Объект.cbr_ОтрасльКонтрагента = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры
//-- cba AlopinAS 27.01.26

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаписатьКонтрагентаПартнера")
&НаСервере
Процедура cbr_ЗаписатьКонтрагентаПартнера()

	СоздатьКонтрагента = КонтрагентПартнера.Пустая();

	Если СоздатьКонтрагента Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект();
	КонецЕсли;

	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, КонтрагентОбъект);

	КонтрагентОбъект.Наименование = Объект.Наименование;
	КонтрагентОбъект.НаименованиеПолное        = Объект.НаименованиеПолное;
	КонтрагентОбъект.НаименованиеМеждународное = НаименованиеМеждународное;
	КонтрагентОбъект.НаименованиеВТранскрипции = НаименованиеВТранскрипции;
	КонтрагентОбъект.Партнер                   = Объект.Ссылка;
	КонтрагентОбъект.ЮрФизЛицо                 = ЮрФизЛицо;
	КонтрагентОбъект.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонтрагентОбъект.СтранаРегистрации         = СтранаРегистрации;
	КонтрагентОбъект.РегистрационныйНомер      = РегистрационныйНомер;
	КонтрагентОбъект.НалоговыйНомер            = НалоговыйНомер;
	КонтрагентОбъект.ИНН                       = ИНН;
	КонтрагентОбъект.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());
    #Вставка
    //++ Тусеев Н.Ю. 27.01.2026 ПРД2
	КонтрагентОбъект.cbr_КодFO                  = ЭтотОбъект.cbr_КодFO;
    КонтрагентОбъект.cbr_КодBitrix              = ЭтотОбъект.cbr_КодBitrix;	
    //-- Тусеев Н.Ю. 27.01.2026 ПРД2
	#КонецВставки
	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда

		Если СоздатьКонтрагента Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			КонтрагентОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = КонтрагентОбъект.ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = КонтрагентПартнера;
		КонецЕсли;

	КонецЕсли;
	КонтрагентОбъект.ГоловнойКонтрагент = ГоловнойКонтрагент;
	ПартнерыИКонтрагенты.ЗаполнитьКонтактнуюИнформациюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект, Объект.КонтактнаяИнформация);
	ПартнерыИКонтрагентыЛокализация.ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, ЭтаФорма);
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, КонтрагентОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонтрагентОбъект.Записать();

	КонтрагентПартнера = КонтрагентОбъект.Ссылка;

КонецПроцедуры

#КонецОбласти
